{"\u65e5\u671f": 7869, "2015": 4298, "01": 4, "05": 27, "\u958b\u76e4": 7873, "9292": 7281, "30957": 5377, "\u6700\u9ad8": 7871, "\u6700\u4f4e": 7870, "9182": 7186, "019531": 8, "\u6536\u76e4": 7868, "9274": 7263, "110352": 857, "\u8abf\u6574\u5f8c\u6536\u76e4": 7872, "076172": 46, "\u6210\u4ea4\u91cf": 7867, "2311000": 4776, "06": 34, "9209": 7207, "929688": 7284, "9043": 7072, "44043": 5882, "9048": 7076, "339844": 5525, "306641": 5364, "2725800": 5149, "07": 43, "9051": 7079, "94043": 7379, "9108": 7125, "660156": 6234, "9050": 7078, "540039": 6089, "9080": 7105, "089844": 55, "055664": 31, "2384100": 4859, "08": 49, "9154": 7160, "030273": 17, "9246": 7240, "620117": 6184, "9238": 7232, "9237": 7231, "996094": 7835, "2657600": 5101, "09": 56, "9247": 7241, "400391": 5787, "9284": 7273, "570313": 6135, "9215": 7210, "580078": 6140, "545898": 6096, "2398800": 4871, "12": 1224, "9198": 7198, "9229": 7224, "650391": 6224, "9178": 7181, "299805": 5310, "265625": 5098, "2205700": 4661, "13": 1578, "9162": 7167, "769531": 6332, "9253": 7246, "820313": 6535, "9161": 7166, "709961": 6282, "9231": 7226, "799805": 6427, "765625": 6324, "2324800": 4794, "14": 1742, "9235": 7229, "900391": 7040, "9242": 7236, "200195": 4271, "9180": 7184, "230469": 4772, "196289": 4172, "2271500": 4729, "15": 2114, "9197": 7197, "320313": 5442, "9219": 7214, "429688": 5856, "9149": 7155, "099609": 63, "9165": 7169, "2210200": 4668, "16": 2538, "9245": 7239, "9256": 7248, "860352": 6817, "9109": 7126, "459961": 5943, "9138": 7149, "290039": 5258, "255859": 5008, "2591100": 5033, "19": 4085, "9183": 7187, "759766": 6318, "9151": 7157, "9174": 7177, "05957": 33, "025391": 12, "1893500": 4069, "20": 4269, "9188": 7190, "9259": 7251, "9177": 7180, "480469": 5989, "9251": 7244, "69043": 6268, "65625": 6229, "1795000": 3795, "21": 4496, "9283": 7272, "790039": 6396, "9319": 7302, "9275": 7264, "679688": 6252, "675781": 6250, "2174400": 4617, "22": 4655, "9336": 7318, "80957": 6475, "9386": 7363, "55957": 6116, "9369": 7349, "509766": 6046, "475586": 5982, "2387200": 4862, "23": 4768, "9422": 7390, "9471": 7422, "9470": 7421, "905273": 7081, "2647100": 5087, "26": 5039, "9474": 7426, "9478": 7430, "530273": 6075, "9436": 7400, "469727": 5965, "9477": 7429, "669922": 6243, "634766": 6206, "1906500": 4096, "27": 5130, "9505": 7446, "9523": 7459, "730469": 6293, "19043": 4092, "9521": 7458, "589844": 6157, "554688": 6111, "1875400": 4036, "28": 5198, "9503": 7445, "9515": 7454, "9510": 7450, "919922": 7200, "884766": 6967, "1784400": 3726, "29": 5255, "9479": 7431, "360352": 5621, "9482": 7433, "129883": 1571, "9403": 7377, "75": 6311, "9426": 7393, "866211": 6864, "1849600": 3976, "30": 5313, "9452": 7409, "849609": 6729, "9466": 7418, "9361": 7342, "910156": 7122, "875977": 6932, "2041700": 4389, "02": 9, "9368": 7347, "830078": 6590, "9410": 7383, "9352": 7334, "990234": 7789, "956055": 7486, "1650800": 2810, "03": 16, "9394": 7369, "9460": 7415, "169922": 3124, "9448": 7407, "696289": 6272, "1649300": 2801, "04": 21, "519531": 6061, "9533": 7465, "879883": 6947, "9513": 7453, "2134800": 4552, "9511": 7451, "9517": 7456, "419922": 5832, "9472": 7423, "9512": 7452, "049805": 26, "014648": 6, "1523200": 2171, "9456": 7413, "179688": 3811, "144531": 1898, "1533300": 2196, "9465": 7417, "120117": 1229, "9413": 7384, "9421": 7389, "46582": 5956, "1425200": 1816, "10": 64, "9405": 7380, "9435": 7399, "070313": 44, "9390": 7365, "9393": 7368, "700195": 6275, "666016": 6238, "1631400": 2702, "11": 824, "9430": 7397, "9488": 7434, "719727": 6285, "9462": 7416, "219727": 4651, "18457": 3969, "1909200": 4099, "9496": 7440, "389648": 5741, "9500": 7442, "349609": 5575, "9447": 7406, "274414": 5163, "1563800": 2354, "040039": 22, "9542": 7473, "9499": 7441, "969727": 7603, "9529": 7462, "474609": 5977, "1601700": 2547, "24": 4873, "9582": 7503, "9638": 7552, "9629": 7544, "370117": 5660, "333984": 5492, "2332200": 4802, "25": 4962, "9655": 7568, "9699": 7605, "9653": 7566, "50293": 6038, "2209800": 4667, "9687": 7594, "9688": 7596, "9610": 7527, "9622": 7537, "063477": 37, "2117000": 4516, "9665": 7576, "9690": 7598, "9588": 7509, "9601": 7521, "324219": 5462, "2202800": 4657, "9628": 7542, "9642": 7556, "950195": 7443, "9571": 7495, "639648": 6210, "9605": 7523, "733398": 6296, "1882000": 4047, "9596": 7516, "240234": 4878, "9635": 7549, "9580": 7501, "780273": 6363, "9621": 7536, "694336": 6270, "1910300": 4101, "9627": 7541, "9631": 7546, "9564": 7490, "9595": 7515, "053711": 30, "1921600": 4111, "9587": 7508, "9645": 7558, "9574": 7497, "549805": 6100, "2120500": 4521, "9617": 7534, "9549": 7478, "9562": 7488, "980469": 7705, "944336": 7404, "1785400": 3734, "9566": 7492, "9583": 7504, "9520": 7457, "330078": 5483, "9536": 7467, "495117": 6022, "2012200": 4294, "280273": 5200, "9561": 7487, "2230500": 4691, "9537": 7468, "9608": 7525, "9530": 7463, "740234": 6303, "963867": 7553, "2358800": 4831, "9633": 7548, "9579": 7500, "313477": 5405, "1941300": 4140, "450195": 5911, "9590": 7511, "875": 6924, "1773200": 3658, "17": 3130, "9555": 7482, "9539": 7470, "405273": 5800, "2021100": 4318, "18": 3827, "9563": 7489, "393555": 5759, "2195500": 4648, "9668": 7580, "009766": 3, "9745": 7650, "9736": 7640, "693359": 6269, "2389700": 4864, "9706": 7611, "9749": 7654, "9705": 7610, "65332": 6226, "2580300": 5026, "9759": 7663, "9775": 7679, "629883": 6197, "9729": 7633, "9758": 7662, "052734": 29, "2206800": 4662, "959961": 7519, "9768": 7672, "9701": 7606, "9731": 7635, "623047": 6188, "1945600": 4149, "9739": 7644, "9743": 7648, "9667": 7578, "793945": 6405, "1966300": 4181, "9619": 7535, "9540": 7471, "083984": 53, "2194600": 4646, "9593": 7513, "68457": 6258, "2251300": 4711, "379883": 5700, "9556": 7483, "870117": 6896, "834961": 6627, "1783800": 3721, "31": 5384, "9568": 7493, "9594": 7514, "9527": 7461, "9586": 7507, "404297": 5797, "2184800": 4635, "9575": 7498, "9507": 7447, "625": 6190, "1788200": 3752, "9535": 7466, "9600": 7520, "28418": 5219, "1860500": 4001, "9613": 7529, "9641": 7555, "864258": 6850, "2011600": 4291, "9646": 7559, "9654": 7567, "933594": 7317, "1983700": 4224, "9597": 7517, "209961": 4494, "9663": 7574, "9559": 7485, "003906": 1, "2165100": 4603, "9626": 7540, "9648": 7562, "839844": 6664, "664063": 6237, "2002700": 4273, "9666": 7577, "483398": 5993, "1855700": 3989, "9664": 7575, "183594": 3943, "2034000": 4358, "150391": 2127, "9508": 7448, "139648": 1730, "024414": 11, "2435600": 4907, "9578": 7499, "9656": 7569, "833984": 6619, "2224100": 4686, "599609": 6165, "9615": 7532, "9570": 7494, "893555": 7002, "2047400": 4396, "9541": 7472, "9572": 7496, "9552": 7480, "814453": 6503, "1925300": 4114, "9554": 7481, "9598": 7518, "945313": 7411, "2098100": 4489, "610352": 6175, "9630": 7545, "9612": 7528, "2128600": 4537, "9814": 7715, "9797": 7698, "490234": 6011, "453125": 5920, "3637800": 5637, "9839": 7735, "9961": 7836, "9913": 7797, "243164": 4902, "3791200": 5697, "9941": 7819, "10002": 66, "9937": 7817, "9973": 7846, "082031": 51, "3381800": 5517, "9998": 7865, "080078": 50, "10014": 75, "9918": 7802, "9956": 7830, "791992": 6401, "2770800": 5181, "9934": 7815, "9978": 7850, "9842": 7737, "9853": 7747, "792969": 6404, "2859900": 5228, "9841": 7736, "9894": 7780, "9820": 7721, "012695": 5, "2644700": 5084, "9871": 7759, "9800": 7702, "9845": 7740, "00293": 0, "2298800": 4766, "9849": 7744, "9855": 7749, "9788": 7692, "092773": 59, "9780": 7684, "9829": 7728, "9735": 7639, "9818": 7719, "163086": 2695, "2353700": 4826, "9789": 7693, "9704": 7609, "073242": 45, "2315900": 4782, "9724": 7628, "9760": 7664, "9692": 7600, "9691": 7599, "962891": 7543, "2012000": 4293, "9763": 7667, "683594": 6257, "2383200": 4858, "9637": 7551, "9702": 7607, "9680": 7588, "2141500": 4565, "9697": 7602, "2129200": 4539, "9730": 7634, "9734": 7638, "2198400": 4653, "9644": 7557, "444336": 5890, "1997700": 4262, "9603": 7522, "9550": 7479, "9606": 7524, "2154300": 4586, "9623": 7538, "9722": 7626, "9716": 7619, "732422": 6294, "2439000": 4912, "9726": 7630, "9662": 7573, "9685": 7593, "272461": 5148, "2182900": 4629, "9647": 7560, "160156": 2546, "523438": 6066, "2176000": 4619, "9674": 7584, "763672": 6323, "2176100": 4620, "9589": 7510, "133789": 1637, "1568200": 2378, "9649": 7563, "9669": 7581, "410156": 5813, "374023": 5677, "1727100": 3331, "889648": 6986, "9710": 7615, "9693": 7601, "2376600": 4853, "9741": 7646, "9766": 7670, "9712": 7617, "802734": 6441, "2366200": 4837, "9727": 7631, "9747": 7652, "269531": 5126, "033203": 19, "3159400": 5421, "9625": 7539, "654297": 6227, "1981100": 4218, "9657": 7570, "9584": 7505, "9614": 7530, "259766": 5038, "223633": 4695, "2134600": 4551, "484375": 5994, "2285900": 4747, "9558": 7484, "9325": 7307, "9348": 7330, "595703": 6164, "2951500": 5287, "9328": 7310, "9371": 7351, "9272": 7261, "9340": 7322, "095703": 60, "2478600": 4948, "9324": 7306, "9419": 7388, "9258": 7250, "395508": 5766, "2178100": 4624, "9346": 7328, "9363": 7344, "9191": 7192, "835938": 6638, "2785900": 5190, "9334": 7316, "9298": 7285, "2190900": 4643, "9330": 7312, "9358": 7339, "9302": 7290, "456055": 5927, "2059600": 4426, "9304": 7292, "9339": 7321, "9263": 7254, "9301": 7288, "895508": 7012, "1713100": 3225, "9252": 7245, "446289": 5897, "1595200": 2517, "9212": 7208, "746094": 6309, "1737300": 3406, "9232": 7227, "9170": 7174, "9189": 7191, "795898": 6411, "2054200": 4412, "9243": 7237, "9187": 7189, "9218": 7213, "335938": 5505, "1959000": 4167, "9341": 7323, "735352": 6297, "1993500": 4251, "9375": 7354, "9438": 7401, "9391": 7366, "105469": 425, "1944900": 4146, "9409": 7382, "9364": 7345, "9397": 7372, "275391": 5171, "1725600": 3322, "9415": 7386, "9476": 7428, "304688": 5348, "2096500": 4486, "9481": 7432, "9489": 7435, "9442": 7403, "535156": 6079, "1584100": 2457, "9227": 7221, "9236": 7230, "06543": 38, "1867400": 4018, "9223": 7217, "9323": 7305, "9204": 7205, "9322": 7304, "985352": 7748, "1858800": 3996, "9311": 7297, "9404": 7378, "1618400": 2634, "9372": 7352, "9400": 7375, "9350": 7332, "9379": 7357, "206055": 4428, "1753300": 3516, "9265": 7256, "1571900": 2397, "9309": 7296, "9347": 7329, "9255": 7247, "925781": 7249, "1580600": 2438, "9278": 7267, "9332": 7314, "9244": 7238, "9250": 7243, "125977": 1372, "1872800": 4028, "9225": 7219, "8946": 7006, "8976": 7025, "077148": 47, "3059900": 5358, "8861": 6972, "8750": 6925, "8914": 6993, "09668": 61, "2589100": 5030, "nan": 7866, "9041": 7070, "9033": 7065, "886719": 6976, "2077600": 4458, "9061": 7088, "9124": 7137, "726563": 6289, "2139300": 4560, "9063": 7090, "9089": 7114, "9005": 7042, "9054": 7082, "166992": 2939, "1789400": 3761, "9062": 7089, "9085": 7111, "9021": 7055, "9042": 7071, "176758": 3623, "1666800": 2920, "9060": 7087, "9079": 7104, "9018": 7054, "9045": 7074, "947266": 7424, "1615500": 2616, "8952": 7010, "8975": 7024, "8974": 7022, "966797": 7579, "1767100": 3619, "8997": 7034, "9010": 7047, "8940": 7004, "926758": 7258, "1714600": 3237, "8955": 7011, "8968": 7018, "8896": 6985, "8918": 6996, "666992": 6239, "1720100": 3280, "8865": 6974, "8895": 6984, "8751": 6926, "8791": 6944, "087891": 54, "2076700": 4455, "8809": 6953, "8811": 6955, "8733": 6913, "8767": 6937, "828125": 6574, "1622400": 2654, "8553": 6770, "8556": 6772, "647461": 6220, "2322200": 4790, "8566": 6782, "8635": 6845, "8532": 6754, "8582": 6796, "458008": 5933, "2273000": 4731, "8587": 6801, "8619": 6831, "8516": 6744, "8563": 6778, "448242": 5902, "2046200": 4393, "8567": 6783, "8697": 6892, "8651": 6855, "2008700": 4284, "8670": 6871, "8676": 6876, "8591": 6805, "8665": 6867, "307617": 5369, "2024400": 4336, "8636": 6846, "8482": 6718, "8524": 6749, "37793": 5691, "1822300": 3904, "8538": 6760, "8590": 6804, "8433": 6685, "8510": 6739, "2242500": 4702, "8504": 6735, "8486": 6721, "8542": 6763, "237305": 4846, "1849400": 3975, "8564": 6779, "8586": 6800, "8404": 6668, "8449": 6694, "527344": 6070, "1995900": 4255, "8409": 6672, "8458": 6702, "8368": 6645, "8442": 6692, "257813": 5025, "1654200": 2837, "8410": 6673, "8484": 6719, "8374": 6648, "8466": 6707, "807617": 6465, "1708400": 3192, "8393": 6659, "8394": 6660, "107422": 590, "2176400": 4622, "8365": 6644, "8376": 6649, "8235": 6550, "8283": 6576, "347656": 5569, "2319000": 4785, "8284": 6577, "8348": 6625, "8271": 6564, "8311": 6596, "708008": 6279, "2002800": 4274, "8315": 6600, "8343": 6622, "8305": 6592, "607422": 6170, "1771200": 3648, "8307": 6593, "8308": 6594, "8213": 6539, "387695": 5732, "1730700": 3359, "8237": 6551, "8277": 6570, "8166": 6516, "77002": 6334, "8177": 6523, "220215": 4656, "189453": 4071, "8182": 6526, "810059": 6477, "7987": 6423, "569824": 6133, "8021": 6438, "809082": 6472, "2562600": 5012, "8008": 6435, "680176": 6253, "8063": 6455, "7951": 6408, "720215": 6286, "8029": 6442, "779297": 6360, "2051500": 4407, "7941": 6406, "7786": 6357, "891113": 6990, "2548500": 5003, "7719": 6341, "7203": 6287, "069824": 42, "7410": 6304, "312012": 5397, "3913000": 5751, "7427": 6306, "359863": 5620, "7677": 6329, "930176": 7289, "7368": 6298, "470215": 5967, "7675": 6328, "640137": 6216, "611328": 6176, "3020700": 5326, "7636": 6322, "7762": 6351, "7547": 6316, "609863": 6174, "7715": 6340, "561035": 6121, "2504000": 4967, "7856": 6385, "399902": 5786, "7824": 6371, "520508": 6063, "2625000": 5065, "7923": 6403, "8039": 6446, "8019": 6437, "180176": 3838, "149414": 2088, "2574100": 5021, "8026": 6440, "8174": 6522, "7961": 6412, "88916": 6983, "2653300": 5095, "8117": 6489, "8119": 6490, "899902": 7036, "8002": 6431, "8017": 6436, "560059": 6117, "529297": 6073, "2184600": 4634, "7970": 6416, "8068": 6459, "060059": 35, "7907": 6399, "310059": 5385, "8035": 6444, "259277": 5034, "2197000": 4650, "8071": 6460, "8101": 6478, "8007": 6433, "47998": 5987, "8095": 6474, "919434": 7195, "2443000": 4916, "8087": 6470, "8128": 6494, "22998": 4767, "7990": 6424, "859863": 6813, "8000": 6429, "600098": 6166, "569336": 6130, "2329400": 4800, "8053": 6449, "7957": 6410, "7986": 6422, "1496400": 2098, "7993": 6426, "100098": 71, "8031": 6443, "7978": 6419, "779785": 6361, "8001": 6430, "469238": 5962, "1503100": 2123, "8097": 6476, "8296": 6587, "8286": 6579, "887695": 6978, "2746900": 5168, "8247": 6555, "8274": 6568, "8214": 6540, "8268": 6563, "2036300": 4369, "8313": 6598, "8233": 6549, "788086": 6390, "1841800": 3959, "8332": 6612, "8360": 6639, "8259": 6559, "1769100": 3634, "8320": 6604, "8327": 6608, "8226": 6544, "958008": 7502, "1622000": 2653, "8298": 6588, "8342": 6621, "8276": 6569, "8333": 6613, "1864800": 4012, "8377": 6650, "8467": 6708, "8445": 6693, "467773": 5958, "2321600": 4789, "8427": 6682, "8488": 6722, "8399": 6665, "8462": 6703, "2296800": 4761, "8285": 6578, "007813": 2, "1810100": 3863, "8331": 6611, "8325": 6606, "1758200": 3551, "8310": 6595, "8186": 6529, "8193": 6531, "1933600": 4127, "8224": 6543, "8257": 6557, "8123": 6493, "069336": 41, "1964900": 4178, "8131": 6495, "8152": 6507, "8061": 6453, "8132": 6496, "350098": 5576, "319336": 5438, "1654300": 2839, "149902": 2109, "8181": 6525, "8059": 6452, "209473": 4484, "2283600": 4745, "8194": 6532, "8317": 6602, "8170": 6520, "8295": 6586, "908203": 7108, "2108700": 4505, "8290": 6581, "8253": 6556, "8304": 6591, "998047": 7853, "1758800": 3555, "8364": 6643, "8316": 6601, "8352": 6629, "328125": 5477, "1933400": 4125, "8390": 6658, "067383": 40, "2193800": 4645, "8398": 6663, "8495": 6727, "8385": 6655, "198242": 4221, "2089300": 4477, "8528": 6750, "8544": 6765, "8434": 6686, "927734": 7266, "1977700": 4210, "8478": 6716, "8578": 6793, "8573": 6787, "6875": 6261, "2081500": 4466, "8571": 6786, "8574": 6788, "8518": 6745, "1877100": 4041, "8545": 6766, "8515": 6743, "8522": 6747, "477539": 5984, "1941200": 4139, "8652": 6856, "8601": 6815, "487305": 6006, "2055300": 4416, "8596": 6810, "8627": 6838, "8604": 6818, "917969": 7183, "2165800": 4607, "8628": 6839, "8603": 6816, "8631": 6841, "1765400": 3607, "8663": 6865, "8618": 6830, "8653": 6857, "567383": 6125, "1994500": 4254, "8668": 6870, "8690": 6886, "8609": 6823, "2022800": 4328, "8600": 6814, "8594": 6807, "8608": 6822, "427734": 5849, "1675200": 2974, "8671": 6872, "8740": 6918, "8662": 6863, "8673": 6874, "777344": 6355, "1974500": 4202, "8706": 6899, "8757": 6929, "8745": 6921, "1778100": 3689, "8724": 6909, "8701": 6895, "288086": 5242, "1841000": 3958, "8679": 6877, "8714": 6905, "8632": 6842, "1784700": 3729, "8682": 6881, "8704": 6898, "8568": 6784, "047852": 25, "1985000": 4230, "8503": 6734, "8554": 6771, "277344": 5183, "1963300": 4174, "8614": 6827, "737305": 6299, "1570900": 2390, "8643": 6851, "8728": 6911, "8713": 6904, "158203": 2446, "2018200": 4307, "8759": 6931, "8864": 6973, "8754": 6927, "8857": 6970, "8856": 6969, "987305": 7762, "2620400": 5058, "8858": 6971, "8871": 6977, "8828": 6961, "8850": 6968, "147461": 2010, "1999200": 4266, "8693": 6890, "538086": 6086, "2240500": 4700, "8702": 6897, "8746": 6922, "8623": 6834, "8642": 6849, "1754100": 3523, "8529": 6751, "8536": 6758, "868164": 6880, "1703500": 3154, "8543": 6764, "8557": 6773, "8415": 6676, "8414": 6675, "977539": 7680, "1930600": 4120, "8426": 6681, "8428": 6683, "057617": 32, "1541900": 2238, "8402": 6667, "8453": 6697, "8329": 6610, "1693800": 3091, "8278": 6571, "8312": 6597, "8217": 6542, "368164": 5650, "1820000": 3894, "8369": 6646, "8471": 6710, "8419": 6678, "1799600": 3825, "8432": 6684, "8455": 6699, "8326": 6607, "8340": 6620, "4375": 5877, "1761600": 3574, "8382": 6654, "8477": 6715, "8357": 6635, "167969": 3006, "1792800": 3779, "8472": 6711, "8465": 6706, "417969": 5827, "1579100": 2430, "8480": 6717, "8450": 6695, "8485": 6720, "698242": 6273, "1530200": 2188, "8497": 6730, "8397": 6662, "8400": 6666, "1630600": 2693, "8407": 6670, "8386": 6656, "097656": 62, "1693600": 3090, "8411": 6674, "1659700": 2873, "8493": 6725, "8505": 6736, "1419800": 1793, "8339": 6618, "8239": 6552, "578125": 6139, "3289700": 5479, "8359": 6637, "8463": 6704, "267578": 5118, "1974700": 4203, "8475": 6713, "8441": 6691, "8457": 6701, "1939900": 4136, "8424": 6680, "8456": 6700, "027344": 13, "1826900": 3924, "8423": 6679, "8355": 6631, "8535": 6756, "8454": 6698, "1799000": 3821, "8335": 6615, "2054400": 4413, "8229": 6547, "587891": 6155, "2149800": 4577, "8228": 6546, "8133": 6497, "8216": 6541, "137695": 1685, "2110400": 4509, "8108": 6483, "8115": 6487, "890137": 6987, "859375": 6806, "2056200": 4420, "8058": 6451, "97998": 7701, "7980": 6421, "8040": 6447, "129395": 1541, "1808300": 3856, "8074": 6462, "8140": 6499, "8073": 6461, "1674400": 2969, "8144": 6502, "029785": 15, "8204": 6536, "8121": 6491, "8184": 6527, "629395": 6196, "1987800": 4236, "8319": 6603, "637695": 6208, "2194700": 4647, "8272": 6566, "8241": 6554, "8289": 6580, "8191": 6530, "529785": 6074, "8282": 6575, "2161800": 4601, "8261": 6560, "8292": 6583, "1832100": 3935, "667969": 6240, "1938800": 4133, "8351": 6628, "8324": 6605, "1710600": 3210, "8328": 6609, "8363": 6642, "248047": 4950, "1236500": 1326, "8358": 6636, "1219000": 1297, "8349": 6626, "8293": 6584, "87793": 6940, "1186200": 1191, "8262": 6561, "8279": 6572, "1300600": 1579, "8273": 6567, "8338": 6617, "8258": 6558, "1191500": 1201, "2016": 4302, "8109": 6484, "8114": 6486, "229004": 4751, "1717400": 3259, "8105": 6480, "8142": 6501, "8055": 6450, "8075": 6463, "109863": 812, "079102": 48, "8064": 6456, "8076": 6464, "7948": 6407, "430176": 5858, "390137": 5745, "359375": 5615, "2040600": 4385, "7963": 6414, "7770": 6354, "7852": 6382, "2544700": 5001, "7811": 6366, "7906": 6398, "7788": 6359, "7893": 6393, "970215": 7608, "939941": 7374, "1875700": 4038, "7855": 6384, "7726": 6342, "391113": 5749, "1949300": 4152, "7807": 6364, "7851": 6381, "7732": 6344, "7768": 6353, "421387": 5834, "2027700": 4342, "7799": 6362, "7865": 6387, "580566": 6142, "1698800": 3122, "7752": 6348, "7662": 6325, "7742": 6346, "851074": 6740, "1809100": 3858, "7809": 6365, "7842": 6378, "7708": 6338, "7761": 6350, "980957": 7710, "1991800": 4243, "7678": 6330, "7834": 6376, "7627": 6321, "151367": 2146, "1942500": 4143, "7816": 6368, "7854": 6383, "850098": 6731, "1581200": 2441, "7835": 6377, "7687": 6331, "7699": 6333, "091309": 58, "2046500": 4394, "7713": 6339, "7748": 6347, "7664": 6327, "7663": 6326, "1763600": 3592, "7729": 6343, "7774": 6356, "7706": 6337, "140137": 1747, "7756": 6349, "1637300": 2733, "7813": 6367, "72998": 6291, "7899": 6395, "7894": 6394, "119629": 1212, "1623500": 2656, "7832": 6375, "7848": 6379, "7828": 6373, "640625": 6217, "1524700": 2177, "7863": 6386, "7888": 6391, "7830": 6374, "7849": 6380, "800781": 6434, "1478800": 2027, "7825": 6372, "7921": 6402, "7821": 6369, "7905": 6397, "1830200": 3932, "7880": 6389, "8080": 6467, "7876": 6388, "819824": 6534, "2552200": 5006, "8164": 6513, "8110": 6485, "8156": 6509, "929199": 7280, "1818300": 3886, "8141": 6500, "52002": 6062, "8091": 6473, "1768200": 3629, "8036": 6445, "8062": 6454, "972168": 7625, "1781300": 3708, "7976": 6417, "649902": 6222, "7953": 6409, "8066": 6457, "491211": 6017, "1935700": 4128, "8090": 6471, "8227": 6545, "8212": 6538, "050781": 28, "2009100": 4285, "8240": 6553, "8196": 6533, "1847300": 3972, "8337": 6616, "8314": 6599, "2044500": 4390, "8291": 6582, "8280": 6573, "020508": 10, "1715700": 3246, "8396": 6661, "1697400": 3113, "8361": 6640, "8334": 6614, "1849900": 3978, "8264": 6562, "84082": 6671, "1825000": 3916, "8388": 6657, "2028600": 4344, "8380": 6652, "8347": 6624, "140625": 1753, "1967500": 4186, "8381": 6653, "8489": 6723, "8378": 6651, "670898": 6244, "1945500": 4148, "8540": 6761, "2308200": 4775, "8569": 6785, "8630": 6840, "8561": 6776, "8611": 6824, "770508": 6336, "2574500": 5022, "8648": 6852, "8584": 6798, "2396100": 4870, "8656": 6859, "8727": 6910, "8659": 6861, "2424900": 4895, "8655": 6858, "8575": 6790, "8664": 6866, "2643600": 5083, "8649": 6853, "8657": 6860, "8588": 6802, "8634": 6844, "09082": 57, "2198200": 4652, "8633": 6843, "8680": 6878, "8660": 6862, "680664": 6255, "2165700": 4606, "8707": 6900, "8640": 6848, "2073100": 4447, "8777": 6939, "8739": 6917, "8747": 6923, "880859": 6952, "2236200": 4694, "8589": 6803, "2606100": 5041, "8637": 6847, "8699": 6893, "1985300": 4231, "8763": 6934, "8826": 6960, "8716": 6907, "8734": 6914, "2375000": 4848, "8810": 6954, "2473700": 4944, "8840": 6964, "8812": 6956, "1740400": 3426, "8806": 6950, "8814": 6957, "8785": 6942, "1884200": 4054, "8766": 6936, "1743000": 3445, "8765": 6935, "8743": 6919, "1753200": 3515, "8758": 6930, "1484000": 2050, "8737": 6915, "430664": 5859, "1609600": 2583, "8687": 6885, "8711": 6902, "8585": 6799, "8617": 6829, "1903600": 4090, "8624": 6835, "8744": 6920, "1920800": 4110, "8803": 6949, "8695": 6891, "810547": 6481, "2006100": 4279, "8700": 6894, "1542800": 2245, "8605": 6819, "8496": 6728, "8513": 6741, "2018500": 4309, "8523": 6748, "8436": 6688, "8490": 6724, "1783400": 3720, "8464": 6705, "8546": 6767, "8452": 6696, "8541": 6762, "1796500": 3806, "8476": 6714, "8562": 6777, "1435100": 1861, "8613": 6826, "8520": 6746, "8531": 6753, "1695400": 3100, "060547": 36, "1698200": 3118, "8684": 6883, "8719": 6908, "8667": 6869, "1742000": 3436, "1565500": 2363, "8681": 6879, "8686": 6884, "8650": 6854, "8666": 6868, "1311400": 1607, "1525800": 2178, "8502": 6733, "8514": 6742, "460938": 5945, "1800900": 3833, "8549": 6768, "8508": 6738, "630859": 6199, "1397500": 1734, "8560": 6775, "8580": 6794, "8501": 6732, "1593200": 2506, "260742": 5043, "1113800": 916, "8622": 6833, "8581": 6795, "550781": 6102, "1291300": 1531, "8597": 6811, "8537": 6759, "1429000": 1833, "8595": 6808, "8473": 6712, "850586": 6737, "1614700": 2612, "1575700": 2414, "8362": 6641, "8294": 6585, "100586": 95, "1644000": 2770, "8153": 6508, "8185": 6528, "45166": 5915, "1801400": 3836, "8207": 6537, "8122": 6492, "8167": 6517, "941406": 7385, "1609100": 2580, "8169": 6519, "8104": 6479, "8146": 6504, "411621": 5814, "1678500": 2998, "8106": 6482, "811523": 6488, "1365700": 1667, "8168": 6518, "271484": 5141, "1320800": 1619, "439941": 5880, "8135": 6498, "541504": 6092, "1584800": 2461, "8162": 6512, "03125": 18, "1359700": 1661, "7999": 6428, "689941": 6266, "671387": 6246, "2020700": 4315, "8003": 6432, "8067": 6458, "581543": 6144, "1449600": 1915, "8081": 6468, "8151": 6506, "8047": 6448, "461426": 5947, "1500000": 2116, "8159": 6511, "661621": 6235, "1482200": 2044, "961426": 7531, "1377200": 1686, "8165": 6515, "241211": 4884, "1228000": 1319, "8150": 6505, "8356": 6633, "8344": 6623, "420898": 5833, "1882300": 4049, "8354": 6630, "8300": 6589, "1382700": 1703, "8417": 6677, "180664": 3853, "1675500": 2975, "1328900": 1629, "59082": 6160, "1546200": 2261, "1612400": 2596, "2368300": 4841, "1713400": 3228, "8598": 6812, "1713200": 3226, "8565": 6781, "8559": 6774, "34082": 5531, "1446300": 1902, "1253900": 1354, "8692": 6889, "8621": 6832, "1653300": 2827, "8715": 6906, "1745300": 3459, "207031": 4441, "1795700": 3801, "8577": 6792, "8576": 6791, "1324500": 1623, "8606": 6820, "357422": 5608, "1631200": 2700, "8583": 6797, "8494": 6726, "126953": 1415, "1614200": 2608, "8607": 6821, "1676500": 2980, "8612": 6825, "8625": 6837, "907227": 7098, "1441600": 1883, "836914": 6647, "1522900": 2169, "8675": 6875, "1616300": 2621, "1277400": 1457, "8691": 6887, "2544000": 5000, "8406": 6669, "8468": 6709, "857422": 6789, "1349900": 1650, "8438": 6690, "49707": 6027, "1527200": 2181, "8530": 6752, "546875": 6097, "1952800": 4159, "8615": 6828, "2157300": 4592, "8755": 6928, "8738": 6916, "227539": 4737, "1877900": 4042, "8782": 6941, "8712": 6903, "8760": 6933, "1488300": 2060, "1539800": 2227, "1803000": 3843, "897461": 7023, "1591200": 2496, "8795": 6946, "8786": 6943, "457031": 5930, "2165600": 4605, "8794": 6945, "8841": 6965, "447266": 5898, "1993200": 4250, "8847": 6966, "8800": 6948, "2219500": 4677, "8837": 6963, "8877": 6979, "8818": 6959, "8866": 6975, "2035000": 4362, "8949": 7009, "2268200": 4725, "9008": 7044, "2099900": 4495, "9034": 7066, "8972": 7020, "856445": 6780, "2370800": 4845, "9013": 7049, "8969": 7019, "9007": 7043, "2140900": 4563, "9075": 7101, "9009": 7045, "9056": 7084, "2658600": 5104, "9055": 7083, "9004": 7041, "2094400": 4483, "9030": 7062, "8916": 6994, "8991": 7032, "1980900": 4217, "8983": 7028, "9024": 7057, "8960": 7015, "776367": 6352, "1792500": 3776, "9058": 7085, "9084": 7110, "375977": 5681, "2133200": 4547, "9081": 7106, "9015": 7051, "9076": 7102, "625977": 6191, "2369500": 4843, "9066": 7092, "9071": 7097, "8984": 7029, "396484": 5770, "1899200": 4084, "9086": 7112, "9052": 7080, "9068": 7094, "1733700": 3380, "9000": 7037, "8948": 7008, "9001": 7038, "1685800": 3041, "9035": 7067, "1640000": 2746, "9025": 7058, "9101": 7121, "9023": 7056, "9092": 7116, "106445": 510, "1959600": 4169, "9123": 7136, "9153": 7159, "9104": 7124, "9150": 7156, "246094": 4932, "1891100": 4065, "9168": 7173, "9127": 7139, "9155": 7161, "066406": 39, "1911500": 4102, "9160": 7164, "9200": 7201, "9131": 7142, "40625": 5803, "2158200": 4594, "816406": 6514, "2218600": 4676, "9135": 7146, "9173": 7176, "1924700": 4113, "9152": 7158, "9117": 7131, "9148": 7154, "496094": 6025, "1666600": 2919, "9146": 7153, "9082": 7107, "9110": 7127, "34668": 5565, "1762700": 3583, "9121": 7134, "9133": 7144, "9073": 7099, "686523": 6260, "1704800": 3165, "9128": 7140, "9093": 7117, "9122": 7135, "486328": 6002, "1779500": 3697, "9139": 7150, "9175": 7178, "1966900": 4183, "9012": 7048, "8928": 7000, "8981": 7027, "1680100": 3010, "8987": 7031, "9046": 7075, "8986": 7030, "916016": 7165, "1606000": 2567, "9016": 7052, "9017": 7053, "366211": 5643, "1538600": 2218, "9115": 7130, "9031": 7063, "1843600": 3965, "9097": 7118, "706055": 6278, "1535600": 2206, "9136": 7147, "9027": 7059, "15625": 2346, "1604400": 2559, "9113": 7129, "9134": 7145, "1631700": 2704, "9130": 7141, "9044": 7073, "2149900": 4578, "9069": 7095, "8980": 7026, "1891700": 4066, "9038": 7068, "8958": 7014, "537109": 6082, "1968000": 4188, "9032": 7064, "9100": 7120, "9090": 7115, "117188": 1154, "1467300": 1981, "9102": 7123, "9181": 7185, "9098": 7119, "1709300": 3199, "9202": 7203, "1969500": 4193, "9241": 7235, "9273": 7262, "9224": 7218, "9262": 7253, "876953": 6938, "1860000": 3999, "9217": 7212, "9142": 7152, "9164": 7168, "867188": 6873, "1587900": 2482, "8947": 7007, "046875": 24, "1673200": 2962, "9014": 7050, "8885": 6981, "817383": 6521, "1797200": 3814, "8913": 6991, "8965": 7017, "8902": 6988, "287109": 5236, "1755900": 3536, "9003": 7039, "1678200": 2993, "9141": 7151, "1425100": 1814, "9228": 7222, "1624800": 2664, "9290": 7279, "9207": 7206, "24707": 4941, "1489300": 2065, "9240": 7234, "1566400": 2367, "9194": 7194, "506836": 6043, "1242800": 1334, "9303": 7291, "9270": 7260, "1843300": 3962, "9166": 7171, "1606100": 2569, "9234": 7228, "1875": 4032, "1379500": 1693, "9287": 7276, "756836": 6317, "1396600": 1731, "9260": 7252, "9276": 7265, "1339700": 1640, "296875": 5297, "1405800": 1752, "9289": 7278, "9249": 7242, "796875": 6415, "1501300": 2118, "9327": 7309, "9167": 7172, "2070400": 4442, "9201": 7202, "586914": 6152, "1385400": 1709, "9268": 7259, "9285": 7274, "157227": 2398, "1523400": 2172, "9216": 7211, "1479500": 2031, "9074": 7100, "9176": 7179, "1260400": 1374, "9222": 7216, "9157": 7162, "1276700": 1451, "9226": 7220, "1506800": 2134, "9288": 7277, "9331": 7313, "9279": 7268, "9317": 7300, "9306": 7293, "557617": 6115, "1895600": 4075, "9333": 7315, "9343": 7325, "9308": 7295, "1257600": 1364, "9338": 7320, "9399": 7373, "9385": 7362, "1429900": 1838, "9355": 7337, "9362": 7343, "1311100": 1606, "9370": 7350, "9286": 7275, "9299": 7287, "1445200": 1897, "9307": 7294, "9320": 7303, "1372600": 1676, "9314": 7298, "1320100": 1618, "1119300": 948, "9230": 7225, "1373000": 1678, "9126": 7138, "9067": 7093, "256836": 5015, "1401300": 1746, "9065": 7091, "1181400": 1181, "827148": 6565, "1245000": 1337, "9214": 7209, "416992": 5826, "1347800": 1649, "9296": 7283, "8926": 6998, "8943": 7005, "2656500": 5099, "9070": 7096, "9179": 7182, "1998400": 4263, "8957": 7013, "74707": 6310, "2518700": 4982, "8879": 6980, "2151600": 4582, "8927": 6999, "8923": 6997, "8931": 7001, "017578": 7, "1949200": 4151, "8962": 7016, "1851700": 3981, "8998": 7035, "8936": 7003, "8995": 7033, "1704600": 3163, "1779800": 3700, "9049": 7077, "1807800": 3854, "376953": 5684, "2146700": 4573, "217773": 4623, "1926800": 4115, "9137": 7148, "2022700": 4326, "9159": 7163, "1840100": 3955, "1910200": 4100, "9220": 7215, "9192": 7193, "373047": 5674, "1889200": 4061, "9196": 7196, "703125": 6277, "2538900": 4994, "1996000": 4256, "1730600": 3357, "1547800": 2267, "9280": 7269, "762695": 6320, "1649700": 2804, "882813": 6962, "1682800": 3026, "9376": 7355, "853516": 6757, "2170000": 4615, "9383": 7360, "9366": 7346, "9392": 7367, "672852": 6247, "1811800": 3870, "9402": 7376, "9349": 7331, "9382": 7359, "9342": 7324, "132813": 1628, "1856000": 3990, "9395": 7371, "9353": 7335, "512695": 6052, "1658400": 2864, "9337": 7319, "9360": 7341, "342773": 5549, "1692100": 3078, "9326": 7308, "773438": 6345, "1858100": 3994, "9316": 7299, "9239": 7233, "1454800": 1936, "9199": 7199, "40332": 5794, "25293": 4987, "1439700": 1876, "9118": 7132, "743164": 6307, "1427400": 1826, "9112": 7128, "9078": 7103, "632813": 6204, "1333800": 1633, "9088": 7113, "9083": 7109, "533203": 6078, "799000": 6425, "9120": 7133, "9132": 7143, "262695": 5067, "880800": 6951, "9203": 7204, "1195900": 1209, "9172": 7175, "083008": 52, "1239800": 1331, "9186": 7188, "493164": 6020, "1329700": 1630, "2017": 4304, "873047": 6912, "1186600": 1192, "9266": 7257, "953125": 7464, "1322300": 1622, "9282": 7271, "1859300": 3997, "9381": 7358, "9351": 7333, "212891": 4538, "1743800": 3449, "413086": 5816, "1708500": 3194, "9344": 7326, "1514800": 2151, "9384": 7361, "9345": 7327, "1801200": 3834, "9356": 7338, "172852": 3342, "1919300": 4108, "9373": 7353, "9387": 7364, "9378": 7356, "823242": 6548, "1560100": 2331, "9359": 7340, "9281": 7270, "323242": 5460, "1445700": 1899, "9354": 7336, "9294": 7282, "1449700": 1916, "1882800": 4052, "9318": 7301, "113281": 986, "1796100": 3804, "1613400": 2603, "9427": 7394, "9424": 7392, "042969": 23, "9423": 7391, "9468": 7420, "9416": 7387, "943359": 7398, "2147200": 4574, "9502": 7444, "9428": 7396, "3341600": 5493, "9450": 7408, "9455": 7412, "552734": 6107, "2264200": 4722, "9467": 7419, "9548": 7477, "9538": 7469, "3053900": 5353, "2607300": 5042, "9543": 7474, "2893600": 5251, "2733900": 5155, "583008": 6147, "3443400": 5557, "9711": 7616, "9681": 7589, "2743600": 5162, "9698": 7604, "9718": 7621, "2798500": 5196, "9813": 7714, "9723": 7627, "9799": 7700, "75293": 6313, "2986500": 5304, "9826": 7725, "9869": 7757, "9753": 7657, "9771": 7675, "2654800": 5096, "9779": 7683, "9791": 7694, "9754": 7658, "2180300": 4627, "9795": 7696, "9817": 7718, "193359": 4126, "2480000": 4949, "9761": 7665, "9721": 7624, "922852": 7223, "2406100": 4880, "9786": 7690, "9770": 7674, "9778": 7682, "2566100": 5013, "9774": 7678, "9810": 7711, "9748": 7653, "9769": 7673, "302734": 5334, "2525500": 4985, "9757": 7661, "9784": 7688, "9740": 7645, "9750": 7655, "462891": 5949, "2454600": 4925, "9751": 7656, "2474000": 4945, "2522300": 4984, "9672": 7583, "9679": 7587, "203125": 4351, "2180100": 4626, "9682": 7590, "1906000": 4095, "9738": 7643, "1882200": 4048, "9744": 7649, "9773": 7677, "443359": 5887, "2048400": 4398, "9650": 7564, "9658": 7571, "603516": 6168, "2432800": 4903, "2283500": 4744, "333008": 5487, "9720": 7623, "9767": 7671, "2212800": 4672, "9714": 7618, "1836600": 3944, "9837": 7734, "2102200": 4499, "9908": 7793, "9835": 7732, "2689700": 5125, "9905": 7790, "9916": 7800, "9912": 7796, "2118700": 4519, "9923": 7806, "9976": 7849, "9972": 7845, "2317100": 4784, "9911": 7795, "9922": 7805, "9843": 7738, "2270500": 4728, "9921": 7804, "9945": 7821, "9897": 7783, "9930": 7811, "2615300": 5047, "9914": 7798, "9932": 7814, "9892": 7778, "9902": 7788, "973633": 7641, "2324400": 4792, "9907": 7792, "9917": 7801, "9859": 7752, "9876": 7764, "2296100": 4759, "9909": 7794, "9924": 7807, "2595900": 5036, "9887": 7773, "9906": 7791, "9831": 7730, "9856": 7750, "2272800": 4730, "9878": 7766, "9836": 7733, "9848": 7743, "143555": 1864, "9846": 7741, "9811": 7712, "2362400": 4834, "9949": 7824, "473633": 5975, "2734200": 5156, "9946": 7822, "9879": 7767, "2015700": 4300, "9900": 7786, "9873": 7761, "363281": 5631, "2422600": 4892, "9880": 7768, "9898": 7784, "9882": 7770, "2364800": 4835, "9881": 7769, "9896": 7782, "9832": 7731, "2287200": 4749, "2339400": 4809, "9808": 7708, "9868": 7756, "2222700": 4683, "9806": 7706, "9732": 7636, "2179100": 4625, "9762": 7666, "9670": 7582, "2118300": 4518, "9746": 7651, "1763700": 3594, "9725": 7629, "9639": 7554, "2145200": 4570, "9632": 7547, "1820400": 3895, "9717": 7620, "1626700": 2676, "9742": 7647, "9772": 7676, "9683": 7591, "1467700": 1983, "9737": 7642, "2097800": 4488, "9865": 7755, "9827": 7726, "2146400": 4572, "9863": 7754, "9823": 7723, "9860": 7753, "613281": 6177, "1830500": 3933, "9872": 7760, "993164": 7813, "2208800": 4666, "9926": 7809, "9951": 7825, "9925": 7808, "2064300": 4433, "9957": 7831, "9979": 7851, "9955": 7829, "1702700": 3146, "9962": 7837, "9938": 7818, "9967": 7840, "1816700": 3882, "9954": 7828, "9960": 7834, "9899": 7785, "9964": 7838, "1860700": 4003, "10001": 65, "9915": 7799, "2425200": 4896, "9935": 7816, "9971": 7844, "9968": 7841, "1972100": 4198, "10018": 76, "9981": 7854, "10008": 70, "9986": 7856, "1833700": 3937, "10036": 84, "1810800": 3865, "10037": 85, "10058": 94, "9991": 7860, "10031": 81, "2176300": 4621, "10019": 77, "10029": 80, "10013": 74, "1822400": 3905, "9952": 7826, "9969": 7842, "9895": 7781, "1786200": 3738, "9970": 7843, "9947": 7823, "1852200": 3982, "9965": 7839, "9997": 7864, "1636800": 2732, "9994": 7862, "10038": 86, "9992": 7861, "10007": 69, "1747800": 3476, "10059": 96, "10044": 89, "1748400": 3482, "10108": 123, "2021300": 4320, "10090": 112, "10121": 130, "10072": 101, "10101": 120, "1914300": 4105, "10095": 115, "10116": 126, "10025": 79, "10040": 88, "2713500": 5140, "10064": 98, "10100": 119, "10087": 109, "1983100": 4223, "10117": 127, "10152": 147, "2100600": 4497, "10164": 154, "10226": 177, "2208100": 4664, "10213": 170, "10221": 174, "10190": 163, "10206": 167, "2078600": 4460, "10216": 173, "10242": 182, "10183": 161, "10209": 168, "2239900": 4697, "10215": 172, "10235": 179, "10211": 169, "10225": 176, "1756200": 3539, "10238": 180, "10268": 190, "10198": 164, "10199": 165, "2205300": 4660, "10137": 137, "10158": 150, "10109": 124, "1800300": 3830, "10146": 143, "10128": 134, "1635400": 2725, "10142": 140, "10165": 155, "10033": 83, "2131200": 4543, "10079": 105, "10089": 111, "10046": 91, "10088": 110, "1647300": 2788, "10078": 104, "10159": 152, "10073": 102, "10156": 148, "2120200": 4520, "10162": 153, "10250": 185, "1878500": 4043, "10286": 200, "10354": 259, "10324": 232, "1913800": 4104, "10310": 220, "10379": 280, "10274": 195, "10349": 254, "2399200": 4872, "10369": 270, "10403": 301, "10368": 269, "10399": 299, "2010500": 4288, "10422": 317, "10374": 275, "10377": 278, "1952000": 4156, "10341": 247, "10513": 394, "2648600": 5089, "10545": 423, "10489": 372, "10512": 393, "2660200": 5105, "10459": 345, "10382": 283, "10390": 290, "3121300": 5399, "10442": 331, "10476": 360, "10421": 316, "2867000": 5233, "10367": 268, "10395": 295, "10329": 236, "2376900": 4854, "10412": 309, "10363": 265, "2157100": 4591, "10397": 297, "10347": 252, "2445100": 4918, "10352": 257, "10404": 302, "10304": 214, "1994200": 4253, "10380": 281, "10381": 282, "10336": 243, "1694000": 3094, "10343": 249, "10294": 205, "10297": 208, "10331": 238, "10283": 199, "10289": 203, "1964700": 4176, "10313": 223, "10415": 311, "2039900": 4383, "10396": 296, "10450": 338, "10393": 293, "10420": 315, "2196800": 4649, "10418": 313, "10485": 369, "10460": 346, "2645100": 5085, "10466": 352, "10423": 318, "10443": 332, "2292900": 4755, "10467": 353, "10490": 373, "10436": 326, "10457": 343, "2183500": 4631, "10447": 336, "10481": 365, "10429": 323, "2035100": 4363, "10472": 357, "10537": 416, "10506": 386, "2351900": 4823, "10534": 413, "10483": 367, "10499": 381, "2273600": 4733, "10468": 354, "10477": 361, "10428": 322, "1904900": 4093, "10426": 320, "10461": 347, "10406": 304, "1756400": 3540, "10455": 341, "10473": 358, "10463": 349, "1959500": 4168, "10500": 382, "10416": 312, "10419": 314, "2344100": 4811, "10427": 321, "10516": 397, "10508": 388, "2487900": 4955, "10480": 364, "10410": 308, "1915800": 4106, "10366": 267, "2036800": 4371, "10408": 306, "10470": 356, "10437": 327, "2391000": 4865, "10479": 363, "10519": 400, "2351400": 4822, "10464": 350, "10478": 362, "10469": 355, "2125000": 4532, "10510": 390, "2439200": 4913, "10521": 402, "10592": 467, "10579": 456, "2543100": 4997, "10598": 472, "10619": 491, "10533": 412, "10568": 447, "2898600": 5254, "10523": 404, "10536": 415, "2590000": 5031, "10303": 213, "3032100": 5338, "10267": 189, "10338": 244, "2408500": 4881, "10365": 266, "2531500": 4989, "10271": 192, "10311": 221, "2296200": 4760, "10302": 212, "10322": 230, "10245": 183, "10290": 204, "2510400": 4971, "10372": 273, "2588000": 5029, "10330": 237, "10259": 188, "10321": 229, "2316000": 4783, "10316": 225, "10282": 198, "10326": 233, "2165200": 4604, "10353": 258, "10392": 292, "2482000": 4951, "10458": 344, "10378": 279, "2465700": 4937, "10414": 310, "10488": 371, "2716400": 5144, "10497": 379, "10515": 396, "2826800": 5215, "10502": 383, "10542": 421, "10498": 380, "10525": 406, "2738000": 5160, "10518": 399, "10496": 378, "2815800": 5206, "10511": 392, "10574": 452, "10569": 448, "2765700": 5176, "10586": 463, "10609": 481, "10551": 430, "10585": 462, "2800700": 5199, "10576": 453, "10594": 469, "3121700": 5400, "10610": 482, "10555": 434, "2619800": 5055, "10584": 461, "10617": 489, "10564": 443, "2761000": 5174, "10593": 468, "10604": 476, "10547": 426, "2815600": 5205, "10509": 389, "10538": 417, "3227300": 5457, "10553": 432, "10550": 429, "2818200": 5209, "10630": 497, "10656": 518, "10565": 444, "10572": 450, "2977700": 5301, "10646": 512, "2920800": 5268, "10596": 470, "10620": 492, "10532": 411, "2711500": 5138, "2491800": 4958, "10556": 435, "10580": 457, "10520": 401, "3365900": 5509, "10590": 465, "10642": 507, "10581": 458, "10631": 498, "3575300": 5609, "10653": 516, "10664": 526, "10561": 440, "3071500": 5367, "10589": 464, "2745000": 5166, "10603": 475, "10493": 375, "10578": 455, "2312400": 4779, "10571": 449, "10446": 335, "10449": 337, "2427200": 4898, "10335": 242, "2622600": 5060, "10333": 240, "10257": 187, "2348600": 4817, "10357": 261, "10315": 224, "1954500": 4162, "10351": 256, "10288": 202, "10296": 207, "2054900": 4415, "10319": 228, "10273": 194, "1942400": 4142, "10425": 319, "10465": 351, "1730200": 3353, "10462": 348, "10495": 377, "10445": 334, "1916100": 4107, "10530": 410, "1905900": 4094, "10557": 436, "1950000": 4154, "10668": 530, "10641": 506, "2859400": 5227, "10711": 561, "2367700": 4840, "10712": 562, "10724": 573, "10675": 535, "2301200": 4770, "10735": 584, "10774": 618, "10723": 572, "2451900": 4924, "10790": 633, "10798": 639, "2368600": 4842, "10773": 617, "10684": 539, "10720": 569, "2651200": 5093, "10745": 592, "10760": 607, "2173500": 4616, "10737": 585, "10753": 600, "10702": 553, "10728": 577, "2314000": 4780, "10759": 606, "10792": 635, "10731": 580, "2041300": 4387, "10749": 596, "10766": 611, "10726": 575, "10743": 591, "2253000": 4714, "10771": 615, "10794": 637, "10740": 587, "10750": 597, "2517700": 4980, "10756": 603, "10716": 566, "10734": 583, "2228900": 4690, "10757": 604, "10803": 644, "10701": 552, "10709": 559, "3016300": 5325, "10777": 621, "10842": 680, "2240000": 4698, "10768": 612, "10829": 670, "10747": 594, "10793": 636, "2185500": 4636, "10816": 657, "10843": 681, "10785": 629, "10806": 647, "2414200": 4887, "10797": 638, "10827": 668, "10788": 632, "2534500": 4990, "10835": 675, "10765": 610, "10800": 641, "2213600": 4673, "10856": 693, "10858": 695, "10769": 613, "10786": 630, "2241200": 4701, "10820": 661, "10807": 648, "10840": 679, "2593500": 5035, "10839": 678, "10844": 682, "10818": 659, "2513400": 4975, "10802": 643, "10831": 672, "10721": 570, "3008000": 5319, "10713": 563, "10742": 589, "10659": 521, "10732": 581, "2347400": 4816, "10683": 538, "2850600": 5225, "10654": 517, "10687": 541, "2676900": 5119, "10662": 524, "10669": 531, "10600": 473, "2325600": 4796, "10629": 496, "10666": 528, "10625": 494, "2189300": 4640, "10673": 533, "10729": 578, "2471200": 4942, "10706": 556, "2503700": 4966, "10688": 542, "10787": 631, "10779": 623, "3285200": 5478, "10815": 656, "10882": 718, "10801": 642, "10822": 663, "3911700": 5750, "10837": 677, "10872": 708, "10809": 650, "10854": 691, "2681100": 5121, "10847": 685, "10873": 709, "10833": 673, "10836": 676, "10746": 593, "2668100": 5115, "10733": 582, "10752": 599, "10692": 546, "10707": 557, "2961000": 5290, "10762": 609, "10697": 549, "3096300": 5378, "10623": 493, "10650": 513, "10560": 439, "4939100": 6021, "10591": 466, "10665": 527, "3776200": 5689, "10651": 514, "2864500": 5231, "10607": 479, "10635": 502, "10540": 419, "10566": 445, "3126100": 5403, "10541": 420, "10376": 277, "3022600": 5327, "10355": 260, "2740500": 5161, "10398": 298, "2683800": 5122, "10438": 328, "10504": 385, "2334200": 4804, "2164400": 4602, "10444": 333, "2324000": 4791, "10494": 376, "10577": 454, "2447400": 4920, "10517": 398, "10491": 374, "2590700": 5032, "10526": 407, "1861300": 4006, "10544": 422, "10452": 339, "2190500": 4642, "10514": 395, "2155800": 4588, "2116400": 4515, "10503": 384, "10486": 370, "2049900": 4405, "10546": 424, "10522": 403, "1928200": 4116, "10528": 408, "2037800": 4373, "2103300": 4500, "10567": 446, "2223700": 4685, "2411700": 4883, "2018": 4306, "10710": 560, "2375900": 4850, "10813": 654, "2964800": 5293, "10834": 674, "10853": 690, "10848": 686, "3048500": 5351, "10879": 715, "3028400": 5336, "10899": 734, "10918": 752, "10869": 705, "10915": 749, "3246900": 5465, "10922": 756, "10931": 763, "10860": 696, "10914": 748, "2933100": 5273, "10934": 766, "10819": 660, "3224000": 5456, "10824": 665, "10770": 614, "10810": 651, "2736200": 5159, "10883": 719, "2900300": 5257, "10932": 764, "10962": 790, "10911": 745, "10956": 786, "2672500": 5117, "10955": 785, "10986": 811, "10920": 754, "2943900": 5279, "10976": 804, "11030": 853, "10942": 774, "11004": 828, "3337400": 5491, "11048": 866, "11122": 909, "11071": 880, "3069900": 5366, "11123": 910, "11150": 924, "11095": 894, "2661500": 5106, "11169": 937, "11231": 957, "11142": 919, "3222600": 5455, "11243": 960, "11270": 969, "11201": 949, "11253": 964, "3399800": 5527, "11228": 956, "11107": 902, "11152": 926, "3171100": 5429, "11154": 928, "11268": 968, "11131": 914, "11165": 934, "3457900": 5562, "11178": 940, "11089": 891, "11147": 922, "2701400": 5131, "11202": 950, "11246": 962, "11161": 932, "11221": 955, "2450400": 4921, "11189": 946, "11076": 884, "2709200": 5136, "11054": 871, "11158": 930, "11007": 831, "11103": 901, "2642900": 5080, "11139": 917, "11212": 953, "11160": 931, "2257600": 4717, "11151": 925, "11153": 927, "11070": 879, "11126": 911, "2023400": 4331, "10970": 798, "10855": 692, "10946": 777, "2393600": 4867, "10761": 608, "10300": 210, "5183600": 6057, "3145300": 5415, "10559": 438, "2287100": 4748, "10371": 272, "10189": 162, "2895400": 5252, "2387100": 4861, "10714": 564, "2770600": 5180, "10698": 550, "2385800": 4860, "10799": 640, "2623500": 5061, "10890": 725, "2295300": 4758, "10896": 731, "10937": 769, "2697700": 5128, "10805": 646, "2508100": 4969, "10719": 568, "10638": 504, "2135500": 4555, "10727": 576, "2203900": 4659, "10784": 628, "2106300": 4502, "10852": 689, "10823": 664, "2535200": 4991, "10845": 683, "10864": 700, "2457800": 4930, "10908": 742, "11016": 840, "11002": 826, "2759800": 5173, "11022": 845, "11014": 838, "2433800": 4905, "11063": 875, "11015": 839, "11038": 860, "2331000": 4801, "11039": 861, "11052": 870, "11008": 832, "11018": 842, "2124400": 4528, "11010": 834, "10933": 765, "11027": 850, "3071600": 5368, "11066": 877, "10983": 809, "11046": 865, "11020": 843, "10981": 808, "2159800": 4598, "11037": 858, "11072": 881, "11011": 835, "2360400": 4832, "11045": 864, "11120": 908, "10975": 803, "11005": 829, "2637400": 5073, "10863": 699, "10758": 605, "2618800": 5054, "10783": 627, "10781": 625, "2048600": 4399, "10901": 735, "2297400": 4764, "10939": 772, "10865": 701, "1953100": 4160, "10889": 724, "2158300": 4595, "10905": 739, "10969": 797, "10906": 740, "2263300": 4721, "10936": 768, "10888": 723, "2071400": 4446, "10775": 619, "10821": 662, "2124100": 4527, "10880": 716, "10904": 738, "10893": 728, "2664500": 5108, "10885": 720, "10874": 710, "10927": 761, "2943400": 5278, "10961": 789, "10953": 783, "10974": 802, "2560400": 5010, "10984": 810, "2248200": 4709, "10988": 814, "10938": 771, "10965": 793, "2400400": 4875, "10921": 755, "10954": 784, "2341000": 4810, "2646400": 5086, "10917": 751, "2189700": 4641, "10891": 726, "10971": 799, "2490200": 4956, "2349600": 4820, "2324700": 4793, "10680": 537, "2664800": 5109, "10573": 451, "2555100": 5007, "10583": 460, "10618": 490, "2633700": 5071, "2079000": 4462, "10660": 522, "10539": 418, "10657": 519, "2120800": 4522, "10601": 474, "2252100": 4713, "2113300": 4513, "10529": 409, "2055900": 4418, "10632": 499, "1965200": 4179, "10691": 545, "2300800": 4769, "10748": 595, "10689": 543, "10703": 554, "2414400": 4888, "10782": 626, "2472700": 4943, "10808": 649, "2782800": 5188, "10952": 782, "2550800": 5005, "10978": 806, "2652800": 5094, "10897": 732, "2905400": 5260, "2510000": 4970, "10830": 671, "2570800": 5017, "10861": 697, "10979": 807, "10966": 794, "2401700": 4877, "11034": 856, "2535800": 4993, "10991": 816, "10886": 721, "2468500": 4939, "10910": 744, "10977": 805, "2219900": 4678, "10999": 823, "10987": 813, "2463800": 4935, "10929": 762, "10964": 792, "2424700": 4894, "10925": 759, "3159000": 5420, "10909": 743, "4494100": 5906, "10876": 712, "10949": 780, "2817400": 5208, "11109": 903, "2890900": 5250, "11130": 913, "11100": 899, "3024000": 5329, "11111": 904, "11207": 951, "3038200": 5343, "11261": 966, "11188": 945, "11251": 963, "3563000": 5606, "11156": 929, "2935100": 5274, "11168": 936, "11186": 944, "11118": 906, "11149": 923, "2763200": 5175, "11140": 918, "11088": 890, "11144": 921, "3009100": 5320, "11119": 907, "11173": 939, "3259400": 5472, "11143": 920, "11013": 837, "3145600": 5416, "10998": 822, "11087": 889, "3547100": 5598, "3158000": 5419, "3060000": 5359, "10992": 818, "10941": 773, "2522200": 4983, "10828": 669, "10851": 688, "2393700": 4868, "10730": 579, "2616000": 5049, "2357900": 4829, "10633": 500, "2259600": 4719, "10667": 529, "2256100": 4716, "2244500": 4704, "10715": 565, "2685900": 5123, "2081200": 4465, "10690": 544, "10611": 483, "2075800": 4452, "10645": 511, "10608": 480, "2613100": 5046, "2329300": 4799, "10776": 620, "2427500": 4899, "10693": 547, "10676": 536, "2140700": 4562, "10644": 509, "10643": 508, "10738": 586, "2053500": 4411, "2134000": 4549, "10867": 703, "10817": 658, "1889400": 4062, "10778": 622, "2029100": 4346, "10811": 652, "2388600": 4863, "10868": 704, "10826": 667, "2052700": 4410, "10963": 791, "2245800": 4706, "2153400": 4585, "10995": 820, "10957": 787, "1970700": 4196, "2336000": 4807, "11023": 846, "11075": 883, "11009": 833, "2230900": 4692, "11080": 887, "11001": 825, "11033": 855, "10997": 821, "11057": 872, "2513500": 4976, "11062": 874, "11058": 873, "11098": 897, "2144000": 4568, "10919": 753, "2168200": 4612, "11012": 836, "1956900": 4164, "10994": 819, "11024": 847, "1896400": 4078, "1987900": 4238, "11026": 849, "2141000": 4564, "11028": 851, "2004300": 4277, "10972": 800, "2143300": 4567, "2883800": 