{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 添加資料\n",
    "\n",
    "將一批新員工添加到 Neo4j 資料庫中的組織裡，並根據現有組織的人數決定是將新員工添加到已有的組織還是建立新的組織。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# 設定 Neo4j 資料庫的 URI 和認證資訊\n",
    "URI = \"neo4j+s://bfc46ed1.databases.neo4j.io\"\n",
    "AUTH = (\"neo4j\", \"8Yc-sCEfoQN5XjrKlV4VqqMilhv6HM4jLrwzLf2P-Ic\")\n",
    "# 設定每個組織的員工人數上限\n",
    "employee_threshold = 10\n",
    "\n",
    "def main():\n",
    "    # 上下文管理：使用 GraphDatabase 連接到 Neo4j 資料庫\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        # 建立會話\n",
    "        with driver.session(database=\"neo4j\") as session:\n",
    "            # 重複 100 次，也就是添加 100 個員工\n",
    "            for i in range(100):\n",
    "                # 生成員工名稱，這裡以 `Thor` 最為前綴、序號作為後綴\n",
    "                name = f\"Thor{i}\"\n",
    "                # 執行寫入交易，添加員工並取得組織 ID\n",
    "                org_id = session.execute_write(employ_person_tx, name)\n",
    "                # 輸出結果\n",
    "                print(f\"將員工 {name} 加入組織 {org_id}\")\n",
    "\n",
    "\n",
    "# 建立具有給定名稱的新 Person 節點\n",
    "def employ_person_tx(tx, name):\n",
    "    # 使用 `MERGE` 達成如果已存在則不重複建立\n",
    "    result = tx.run(\"\"\"\n",
    "        MERGE (p:Person {name: $name})\n",
    "        RETURN p.name AS name\n",
    "        \"\"\", name=name\n",
    "    )\n",
    "\n",
    "    # 取得最近建立的組織 ID 及其相關聯的員工數量\n",
    "    result = tx.run(\"\"\"\n",
    "        MATCH (o:Organization)\n",
    "        RETURN o.id AS id, COUNT{(p:Person)-[r:WORKS_FOR]->(o)} AS employees_n\n",
    "        ORDER BY o.created_date DESC\n",
    "        LIMIT 1\n",
    "    \"\"\")\n",
    "    org = result.single()\n",
    "\n",
    "    # 如果最近的組織沒有員工，則拋出異常\n",
    "    if org is not None and org[\"employees_n\"] == 0:\n",
    "        raise Exception(\"最新建立的組織是空的。\")\n",
    "        # 交易將回滾 -> 連 Person 都不會建立!\n",
    "\n",
    "    # 如果組織員工數未達上限，將該員工添加到該組織\n",
    "    if org is not None and org.get(\"employees_n\") < employee_threshold:\n",
    "        result = tx.run(\"\"\"\n",
    "            MATCH (o:Organization {id: $org_id})\n",
    "            MATCH (p:Person {name: $name})\n",
    "            MERGE (p)-[r:WORKS_FOR]->(o)\n",
    "            RETURN $org_id AS id\n",
    "            \"\"\", org_id=org[\"id\"], name=name\n",
    "        )\n",
    "    # 如果組織員工數已達上限，建立一個新的組織並將該員工添加到新組織\n",
    "    else:\n",
    "        result = tx.run(\"\"\"\n",
    "            MATCH (p:Person {name: $name})\n",
    "            CREATE (o:Organization {id: randomuuid(), created_date: datetime()})\n",
    "            MERGE (p)-[r:WORKS_FOR]->(o)\n",
    "            RETURN o.id AS id\n",
    "            \"\"\", name=name\n",
    "        )\n",
    "\n",
    "    # 傳出：新員工所屬的組織 ID\n",
    "    return result.single()[\"id\"]\n",
    "\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 顯示資料庫的各項訊息"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "將員工 Thor0 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor1 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor2 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor3 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor4 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor5 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor6 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor7 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor8 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor9 加入組織 15feb112-906c-4744-ba7e-11cbe2e31968\n",
      "將員工 Thor10 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor11 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor12 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor13 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor14 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor15 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor16 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor17 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor18 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor19 加入組織 c0846184-7b34-44ed-b339-91f019cc0882\n",
      "將員工 Thor20 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor21 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor22 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor23 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor24 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor25 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor26 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor27 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor28 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor29 加入組織 7597f545-d932-43c4-9542-88e0249113d2\n",
      "將員工 Thor30 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor31 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor32 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor33 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor34 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor35 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor36 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor37 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor38 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor39 加入組織 3a9a10d5-1c5d-4b6f-82f7-3171ecdd04d4\n",
      "將員工 Thor40 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor41 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor42 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor43 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor44 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor45 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor46 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor47 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor48 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor49 加入組織 97dda3b6-ffa9-4c7e-9f27-f68dc006ee35\n",
      "將員工 Thor50 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor51 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor52 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor53 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor54 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor55 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor56 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor57 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor58 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor59 加入組織 b566be40-2c2b-4aed-afa9-674c04915002\n",
      "將員工 Thor60 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor61 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor62 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor63 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor64 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor65 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor66 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor67 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor68 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor69 加入組織 eb3598a4-f5bc-4f16-895f-2c80cdcf3047\n",
      "將員工 Thor70 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor71 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor72 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor73 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor74 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor75 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor76 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor77 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor78 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor79 加入組織 cc55f346-306d-496e-b9d9-f5d85139db88\n",
      "將員工 Thor80 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor81 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor82 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor83 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor84 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor85 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor86 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor87 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor88 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor89 加入組織 09747735-7819-4f1e-94c0-ee2922ae4abd\n",
      "將員工 Thor90 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor91 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor92 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor93 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor94 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor95 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor96 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor97 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor98 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "將員工 Thor99 加入組織 640ce198-e873-41da-8460-60a91d8343ef\n",
      "總節點數量: 110\n",
      "總關係數量: 100\n",
      "各類型節點數量:\n",
      "['Person']: 100\n",
      "['Organization']: 10\n",
      "各類型關係數量:\n",
      "WORKS_FOR: 100\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# 設定 Neo4j 資料庫的 URI 和認證資訊\n",
    "URI = \"neo4j+s://bfc46ed1.databases.neo4j.io\"\n",
    "AUTH = (\"neo4j\", \"8Yc-sCEfoQN5XjrKlV4VqqMilhv6HM4jLrwzLf2P-Ic\")\n",
    "# 設定每個組織的員工人數上限\n",
    "employee_threshold = 10\n",
    "\n",
    "def main():\n",
    "    # 上下文管理：使用 GraphDatabase 連接到 Neo4j 資料庫\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        # 建立會話\n",
    "        with driver.session(database=\"neo4j\") as session:\n",
    "            # 重複 100 次，也就是添加 100 個員工\n",
    "            for i in range(100):\n",
    "                # 生成員工名稱，這裡以 `Thor` 最為前綴、序號作為後綴\n",
    "                name = f\"Thor{i}\"\n",
    "                # 執行寫入交易，添加員工並取得組織 ID\n",
    "                org_id = session.execute_write(employ_person_tx, name)\n",
    "                # 輸出結果\n",
    "                print(f\"將員工 {name} 加入組織 {org_id}\")\n",
    "\n",
    "            # 統計並顯示資料庫中的資訊\n",
    "            display_database_statistics(session)\n",
    "\n",
    "def employ_person_tx(tx, name):\n",
    "    # 使用 `MERGE` 達成如果已存在則不重複建立\n",
    "    result = tx.run(\"\"\"\n",
    "        MERGE (p:Person {name: $name})\n",
    "        RETURN p.name AS name\n",
    "        \"\"\", name=name\n",
    "    )\n",
    "\n",
    "    # 取得最近建立的組織 ID 及其相關聯的員工數量\n",
    "    result = tx.run(\"\"\"\n",
    "        MATCH (o:Organization)\n",
    "        RETURN o.id AS id, COUNT{(p:Person)-[r:WORKS_FOR]->(o)} AS employees_n\n",
    "        ORDER BY o.created_date DESC\n",
    "        LIMIT 1\n",
    "    \"\"\")\n",
    "    org = result.single()\n",
    "\n",
    "    # 如果最近的組織沒有員工，則拋出異常\n",
    "    if org is not None and org[\"employees_n\"] == 0:\n",
    "        raise Exception(\"最新建立的組織是空的。\")\n",
    "        # 交易將回滾 -> 連 Person 都不會建立!\n",
    "\n",
    "    # 如果組織員工數未達上限，將該員工添加到該組織\n",
    "    if org is not None and org.get(\"employees_n\") < employee_threshold:\n",
    "        result = tx.run(\"\"\"\n",
    "            MATCH (o:Organization {id: $org_id})\n",
    "            MATCH (p:Person {name: $name})\n",
    "            MERGE (p)-[r:WORKS_FOR]->(o)\n",
    "            RETURN $org_id AS id\n",
    "            \"\"\", org_id=org[\"id\"], name=name\n",
    "        )\n",
    "    # 如果組織員工數已達上限，建立一個新的組織並將該員工添加到新組織\n",
    "    else:\n",
    "        result = tx.run(\"\"\"\n",
    "            MATCH (p:Person {name: $name})\n",
    "            CREATE (o:Organization {id: randomuuid(), created_date: datetime()})\n",
    "            MERGE (p)-[r:WORKS_FOR]->(o)\n",
    "            RETURN o.id AS id\n",
    "            \"\"\", name=name\n",
    "        )\n",
    "\n",
    "    # 傳出：新員工所屬的組織 ID\n",
    "    return result.single()[\"id\"]\n",
    "\n",
    "def display_database_statistics(session):\n",
    "    \"\"\"統計並顯示資料庫中的資訊\"\"\"\n",
    "    # 查詢總節點數量\n",
    "    node_count_result = session.run(\"MATCH (n) RETURN COUNT(n) AS node_count\")\n",
    "    node_count = node_count_result.single()[\"node_count\"]\n",
    "    \n",
    "    # 查詢總關係數量\n",
    "    relationship_count_result = session.run(\"MATCH ()-[r]->() RETURN COUNT(r) AS relationship_count\")\n",
    "    relationship_count = relationship_count_result.single()[\"relationship_count\"]\n",
    "    \n",
    "    # 查詢各類型節點數量\n",
    "    node_labels_result = session.run(\"MATCH (n) RETURN DISTINCT labels(n) AS labels, COUNT(n) AS count\")\n",
    "    node_labels = node_labels_result.data()\n",
    "    \n",
    "    # 查詢各類型關係數量\n",
    "    relationship_types_result = session.run(\"MATCH ()-[r]->() RETURN TYPE(r) AS type, COUNT(r) AS count\")\n",
    "    relationship_types = relationship_types_result.data()\n",
    "\n",
    "    # 顯示結果\n",
    "    print(f\"總節點數量: {node_count}\")\n",
    "    print(f\"總關係數量: {relationship_count}\")\n",
    "    print(\"各類型節點數量:\")\n",
    "    for record in node_labels:\n",
    "        print(f\"{record['labels']}: {record['count']}\")\n",
    "    print(\"各類型關係數量:\")\n",
    "    for record in relationship_types:\n",
    "        print(f\"{record['type']}: {record['count']}\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo4j0514",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
